word = "goal"
word = "f" + word[1:]
print(word)
word = "h" + word[1:]
print(word)
# Упражнение 1 количество символов
k= "jdjsdlkjflk;jasfaks"
print(len(k))
# Создайте две строки, выполните их конкатенацию и выведите полученую строку.
a= '142 '
b= ' 150 '
c=' 200'
d= a+b+c
print(d)
# Создайте две строки, воспользуйтесь конкатенацией для добавления
# пробела между ними и выведите результат.
stroka1 = "probel>"
stroka2 = "<mejdy"
stroka3 = stroka1 + " " + stroka2
print(stroka3)
# Выведите строку "zing", используя синтаксис срезов для определения
# правильного диапазона символов в строке "bazinga
slovo = 'bazinga'
print(len(slovo))
print(slovo[2:6])
#Задания выполнены правильно