# response = input("What should 1 shout? ")
# shouted_response = response.upper()
# print("Well, if you insist ... " + shouted_response)
# znakomstvousr = input("Kak teb9 zovyt: ")
# z_znakomsvo = znakomstvousr.upper()
# print("O4enb pri9tno user" + znakomstvousr)

# num = '2 2 3 4 ' * ' 2 2 3 4'
# print(num+num)
# print(num * 3)

# num = int('278') + 2
# print(num)
#
# num1 = float(input("Enter а number to Ье douЬled: "))
# doubed_num = num1 * 2
# print(doubed_num)
#
# num = input("Enter а number to Ье douЫed: ")
# dou8ed_num = float(num) * 2
# print(dou8ed_num)

num_pancakes = 10
n_num1 = "I am going to eat " + str(num_pancakes) + " pancakes."
print(n_num1)

total_pancakes = 10
pancakes_eaten = 5
b= "Only "+ str(total_pancakes * pancakes_eaten) +" pancakes left."
print(b)
# 1. Создайте строку, содержащую целое число. Преобразуйте строку в целое
# число вызовом int(). Чтобы убедиться в том, что новый объект действительно является числом, умножьте его на другое число и выведите
# результат.
g= int('5')
h= g * 5
print(h)
s= 5
a= int(g) * 5
print(a)
 # Повторите предыдущее упражнение, но используйте число с плавающей
# точкой и функцию float ( ) .
q = 5
w = float(q) * 2
print(w)
# Создайте строку и целое число. Выведите их рядом друг с другом одной
# командой print при помощи str( ).
ko = 5
ki = ' lew '
print(str(ko) + ki)
# Напишите программу, которая дважды вызывает input () для получения
# двух чисел от пользователя, перемножает эти числа и выводит результат.
# Если пользователь вводит 2 и 4, программа должна вывести следующий
# текст:
# The product of 2 and 4 is 8.0.

zna4_1= input('Vvedite zna4 1')
zna4_2= input('Vvedite zna4 2')
po=float(zna4_1)* float(zna4_2)
otvet= 'The product of ' + zna4_1 + 'and' + zna4_2 + 'is' + str(po)
print(otvet)