# Создайте литерал кортежа с именем cardinal_numbers, содержащий
# строки "first", "second" и "third" в указанном порядке.

cardinal_numbers = ("first", "second", "third")
print(tuple(cardinal_numbers))
# спользуя индексирование и print (), выведите строку с индексом 1 из
# cardinal_numbers.