# phrase = "it marks the spot"
# for character in phrase:
#     if character == "Х":
#             break
# else:
#     print("There was по 'Х' in the phrase")

# phrase1 = "Привет мирный житель сити 17. Это доктор Брин"
# for character1 in phrase1:
#     if character1 == "П":
#         print("олрл")
#         break
#     elif character1 =="Й":
#         print("В этой фразе есть буквы 'Й'")
# else:
#     print("В этой фразе нет буквы 'А'")
# for п in range(3):
#     password = input("Password: ")
#     if password == "I<ЗBieber":
#         break
#     print("Password is incorrect.")
# else:
#     print("Suspicious activity. The authorities have Ьееп alerted.")

for п in range(3):
    password = input("Ввидите Password: ")
    if password == "123":
        break
    print("Password is incorrect.")
else:
    print("Suspicious activity. The authorities have Ьееп alerted.")

# Задача для новичков. Собеседование.
#
# Напишите программу для вычисления факториала числа.
# Ваша программа должна принимать от пользователя число, которое будет использоваться в качестве аргумента функции.
# Вводимое пользователем число будет целым и не отрицательным.
#
# Пример ввода и вывода:
# Введите число для вычисления факториала: 5
# 120