# 1. Создайте список food, содержащий два элемента: "rice" и "beans"
food = ['rice', 'beans']
print(food)
# 2. Присоедините к food строку "broccoli" методом .append().
food.append('broccoli')
print(food)
# 3. Добавьте в food строки "bread" и "pizza" при помощи метода . extend ().
food.extend(['bread', 'pizza'])
print(food)
# 4Выведите первые два элемента списка food, используя функцию print() и синтаксис сегментов
print(food[0:2])
# 5. Выведите последний элемент food, используя функцию print() и синтаксис сегменты
print(food[-1])

#6. Создайте breakfast из строки "eggs, fruit, orangejuice" при помощи строкового метода. split( ).